### Learning Pandas (5)
#### 15. Reshape MultiIndex Series

In [1]:
import pandas as pd
import seaborn as sns
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
df.survived.mean()

np.float64(0.3838383838383838)

In [4]:
df.groupby('sex').survived.mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [ ]:
df.groupby(['sex', 'class']).survived.mean().unstack()  #unstack func just for separate class in column

C:\Users\Muhammad Maaz\AppData\Local\Temp\ipykernel_9456\1574924337.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['sex', 'class']).survived.mean().unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

#### 16. Contineous to catagorical data

In [9]:
df.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [13]:
# Creating Bin (we are actually converting a range of age to a catagory) using pd.cut func
pd.cut(df.age, bins = [0,18,25,99], labels=['child', 'young', 'adult']). head()
df['new_age'] = pd.cut(df.age, bins = [0,18,25,99], labels=['child', 'young', 'adult']). head()
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_age
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult

#### 17. Converting One Set Of data into Another

In [14]:
df.sex.head()

0      male
1    female
2    female
3    female
4      male
Name: sex, dtype: object

In [15]:
# we are using a dictionary map
df.sex.map({'male':0, 'female': 1})
df['sex_numbered'] = df.sex.map({'male':0, 'female': 1})
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_age,sex_numbered
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,0

In [16]:
df.embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [19]:
df.embarked.factorize()[0]
df['embarked_numbered']= df.embarked.factorize()[0]
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_age,sex_numbered,embarked_numbered
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young,0,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,1,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,1,0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,1,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,0,0

#### 18. Transpose a wide dataFrames

In [20]:
import pandas as pd
import numpy as np

In [21]:
df = pd.DataFrame(np.random.rand(100,10), columns=list('abcdefghij'))
df.head()

,a,b,c,d,e,f,g,h,i,j
0,0.114673,0.714250,0.021586,0.473160,0.697522,0.655056,0.326177,0.466526,0.001240,0.577189
1,0.746133,0.865826,0.272597,0.035018,0.416867,0.307729,0.339750,0.413103,0.557018,0.694280
2,0.914670,0.031657,0.399960,0.294377,0.111682,0.098658,0.862278,0.242949,0.183983,0.124795
3,0.105158,0.942598,0.393160,0.802233,0.659259,0.890091,0.190281,0.018075,0.098045,0.662543
4,0.655366,0.344144,0.615942,0.453136,0.980641,0.325082,0.499840,0.615466,0.177414,0.562082

In [22]:
# for transpose
df.head().T

          0         1         2         3         4
a  0.114673  0.746133  0.914670  0.105158  0.655366
b  0.714250  0.865826  0.031657  0.942598  0.344144
c  0.021586  0.272597  0.399960  0.393160  0.615942
d  0.473160  0.035018  0.294377  0.802233  0.453136
e  0.697522  0.416867  0.111682  0.659259  0.980641
f  0.655056  0.307729  0.098658  0.890091  0.325082
g  0.326177  0.339750  0.862278  0.190281  0.499840
h  0.466526  0.413103  0.242949  0.018075  0.615466
i  0.001240  0.557018  0.183983  0.098045  0.177414
j  0.577189  0.694280  0.124795  0.662543  0.562082